export const MESSAGES = {
  prompt: 'Твои действия> ',
  title: 'БЕРИ МЕЧ И РУБИ!\n',
  actions: {
    takeSword: 'ВЗЯТЬ МЕЧ\n',
    attack: 'РУБИТЬ\n',
    lookAround: 'ПОПЫТАТЬСЯ ОСМОТРЕТЬСЯ\n',
    again: 'НАЧАТЬ ЗАНОВО\n',
    exit: 'ВСЕ! ХВАТИТ С МЕНЯ!\n',
  },
  afterTakeSword: 'Ладонь сжимает рукоять меча - шершавую и тёплую.\n',
  afterAttack: 'Воздух свистит, рассекаемый сталью, и расплывчатый силуэт перед тобой делает сальто назад.\n',
  afterLookAround: 'Серый песок, фиолетовое небо, и расплывчатый клинок, торчащий из твоей грудины.\nВремени не было уже секунду назад; сейчас последние секунды с кровью утекают в песок.\nВы проиграли\n',
};
