export const descriptions = {
  walls: [
    'Над вами возвышаются высокие стены некогда монументального строения.',
    'Время и погода не пощадили некогда былого величия.',
    'Вы прячетесь под чудом уцелевшим карнизом от промозглого дождя.',
  ],
  enemies: [
    'Порой вам кажется, что кто-то притаился в тенях.',
    'Скрежет когтей о камни заставляет вас чаще озираться.',
    'Странные звуки доносятся из-за стены дождя',
  ],
  breaks: [
    'Вы видите огромный обрыв, дно которого теряется в дымке.',
    'Вы слышите далёкой журчание воды. Возможно на дне обрыва находится река.',
  ],
  npc: [
    'Вы ощущаете запах костра и приготовленной пищи.',
    'Вы слышите далекие и тихие голоса. Может это люди?',
  ],
  default: [
    'Серое небо низко нависает над головой.',
    'Разруха и запустение творящиеся вокруг навевают грустные мысли.',
    'Непрекращающийся дождь делает вашу одежду мокрой и тяжелой.',
    'Лужи... некотороые из них доходят вам по колени.',
  ],
} as const;
